app/views/todos/index.html.erb

SELECT SUM("todos"."Time_Estimate") FROM "todos" WHERE "todos"."Complete" IS NULL
---
				data: {confirm: 'Are you sure?'}, :class => 'btn btn-mini btn-danger' %></td>
			<p1><%= Todo.where(Complete: nil).sum(:Time_Estimate) %></p1>