app/controllers/todos_controller.rb

  def index
    completed_todos_ids = params[:todos_ids]
    Todo.complete(completed_todos_ids)
    @todo = current_user.todos.where(Complete: nil).order(:Priority)
---
SELECT "todos".* FROM "todos" WHERE ("todos"."Complete" = 'f' OR "todos"."Complete" IS NULL)  ORDER BY "todos"."Priority" ASC, "todos"."updated_at" ASC