app/controllers/todos_controller.rb

  def index
    completed_todos_ids = params[:todos_ids]
    p "COMPLETED TODOS IDS"
    p completed_todos_ids
    Todo.complete(completed_todos_ids)
    p Todo.all
    p "CURRENT USER TODOS"
    p current_user.todos
    p "CURRENT USER"
    p current_user
    @todo = current_user.todos.where(Complete: nil)
---
SELECT "todos".* FROM "todos"
SELECT  "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."Complete" IS NULL LIMIT 1  [["user_id", 1]]

  def update
    @todo = Todo.find params[:id]
    @todo.update todo_params
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "todos" SET "Time_Estimate" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["Time_Estimate", "2000-01-01 00:30:00.000000"], ["updated_at", "2015-06-08 13:51:24.926010"], ["id", 15]]

  def create
    @todo = current_user.todos.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("Action", "Description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Action", "Create Custom Route"], ["Description", "Need custom route for \"Completed items"], ["created_at", "2015-06-15 16:53:37.225809"], ["updated_at", "2015-06-15 16:53:37.225809"]]

  def edit
    @todo = Todo.find params[:id]
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = NULL LIMIT 1

  def destroy
    @todo = Todo.find params[:id]
    @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 12]]